Repository: sheilagomes/wp-trad
Catalog: tm/GNOME_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: The color and opacity of the highlight border.
pt_br: A cor e a opacidade da borda do destaque.

source: Native
pt_br: Nativo

source: Script Type
pt_br: Tipo de Script

source: Script Recorder
pt_br: Gravador de script

source: Creates dogtail style scripts
pt_br: Criar scripts estilo "dogtail"

source: The current script will be lost.
pt_br: O script atual será perdido.

source: Confirm clear
pt_br: Confirmar limpeza

source: focusable %s has table interface, no selection interface
pt_br: focalizável %s possui uma interface de tabela, e interface de seleçãobutton has focused state without focusable state

source: translator-credits
pt_br: Washington Lins <washington\-lins\@uol\.com\.br> Luiz Armesto <luiz\.armesto\@gmail\.com> Og Maciel <ogmaciel\@gnome\.org> Leonardo Ferreira Fontenelle <leonardof\@gnome\.org> Vladimir Melo <vladimirmelo\.psi\@gmail\.com>

source: Full name
pt_br: Nome completo

source: Key binding
pt_br: Atalho do teclado

source: Content type
pt_br: Tipo de conteúdo

source: Accerciser Manual v0.2.0
pt_br: Manual do Accerciser v0.2.0

source: Accerciser team
pt_br: Equipe do Accerciser

source: This manual describes version 0.1.5 of Accerciser.
pt_br: Este manual descreve a versão 0.1.5 do Accerciser.

source: This manual describes the use of Accerciser.
pt_br: Este manual descreve o uso do Accerciser.

source: To report a bug or make a suggestion regarding the Accerciser application or this manual, follow the directions in the GNOME Feedback Page.
pt_br: Para relatar algum erro ou fazer uma sugestão relacionada ao aplicativo Accerciser ou este manual, visite a página de feedback do GNOME.

source: Introduction
pt_br: IntroduçãoPython

source: Accerciser is an interactive Python accessibility explorer for the GNOME desktop. It uses AT-SPI to inspect and control widgets, allowing you to check if an application is providing correct information to assistive technologies and automated test frameworks. Accerciser has a simple plugin framework which you can use to create custom views of accessibility information.
pt_br: O Accerciser é um explorador interativo de acessibilidade para o ambiente GNOME. Escrito em Python, ele utiliza o AT-SPI para inspecionar e controlar widgets, permitindo que você verifique se um aplicativo está fornecendo informações corretas para as tecnologias assistivas e frameworks para testes automatizados. O Accerciser possui um framework simples de plug-ins que você pode utilizar para criar visualizações personalizadas de informações de acessibilidade.

source: In essence, Accerciser is a next generation at-poke tool.
pt_br: Em essência, o Accerciser é uma nova geração da ferramenta at-poke.introdução não serveintrodution

source: To Start Accerciser
pt_br: Para iniciar o Accerciser

source: You can start Accerciser in the following ways:
pt_br: Você pode iniciar o Accerciser das seguintes formas:

source: Applications menu
pt_br: Menu Aplicativos

source: Choose the ProgrammingAccerciser menu item.
pt_br: Vá até o item de menu DesenvolvimentoAccerciser.

source: Command line
pt_br: Linha de comando

source: Type the following command in a console window then press Return:
pt_br: Digite o seguinte comando em uma janela de console e depois pressione Enter:

source: When You Start Accerciser
pt_br: Iniciando o Accerciser

source: When you start Accerciser, the following window is displayed.
pt_br: Quando você iniciar o Accerciser, a seguinte janela será exibida.

source: Accerciser Main Window
pt_br: Janela principal do Accerciser

source: Shows main window. Contains title bar, menu bar, accessible tree , right plugin display area, and bottom plugin display area. The menu bar contains File, Edit, Bookmarks, View, and Help menus.
pt_br: Mostra a janela principal do . Contém a barra de título, a barra de menus, a hierarquia de acessibilidade, a área esquerda de exibição de plug-in e a área inferior de exibição de plug-in. A barra de menu contém os menus Arquivo, Editar, Marcadores, Ver e Ajuda.

source: The main Accerciser window contains the following elements:
pt_br: A janela principal do Accerciser contém os seguintes elementos:

source: Menubar
pt_br: Barra de menu

source: The menu bar contains commands for managing plugins, managing and using bookmarks, refreshing the accessible tree view, and accessing this help system.
pt_br: A barra de menu contém comandos para gerenciar plug-ins, gerenciar e usar marcadores, atualizar a visão em árvore de acessibilidade e acessar este sistema de ajuda.

source: Accessible tree view
pt_br: Visão em árvore de acessíveis

source: The accessible tree view allows to view all of the accessibles starting at the desktop level. Selecting an accessible makes it available for further inspection using the loaded plugins.
pt_br: A visão em árvore de acessíveis permite visualizar todos os objetos acessíveis iniciando no nível da área de trabalho. Selecionar um objeto acessível torna-o disponível para inspeção adicional com os plug-ins carregados.

source: Right plugin view
pt_br: Visão direita de plug-ins

source: This is one of the two default plugin views. When Accerciser is first run, most plugins will reside here. You can drag plugin tabs to the bottom plugin view or to the desktop to show two or more plugins simultaneously.
pt_br: Esta é uma das duas visões padrão de plug-in. Quando o Accerciser for executado pela primeira vez, a maioria dos plug-ins estarão localizados aqui. Você pode arrastar as abas de plug-ins para a visão inferior ou para a área de trabalho para mostrar dois ou mais plug-ins simultaneamente.

source: Bottom plugin view
pt_br: Visão inferior de plug-ins

source: You can drag plugins to or from this area just like the right plugin view.
pt_br: Você pode arrastar plug-ins para esta área ou a partir dela da mesma forma que na visão direita de plug-ins.

source: Plugin View Management
pt_br: Gerenciando a visão de plug-ins

source: Accerciser has two modes for viewing plugins. The current view mode could be toggled with ViewSingle plugin view or by pressing Controlt. When single mode is enabled, all plugins will be put in the top right plugin view and ordered alphabetically, this could be useful for screen reader users who have no use for Accerciser's flexible plugin spacial layout scheme. When single view mode is disabled plugin tabs could be dragged and dropped in to different plugin views, or could be dragged to the desktop to put the given plugin in a new view. The placement of plugins could also be manipulated with the plugin context menu that could be brought up either from the plugin tab, or the plugin preferences dialog.
pt_br: O Accerciser tem dois modos de visão de plug-ins. O modo de exibição atual poder ser alternado em VerVisão unificada de plug-ins ou pressionando Controlt. Quando o modo unificado é habilitado, todos os plug-ins serão postos na visão direita de plug-ins e ordenados alfabeticamente. Isso pode ser útil para usuários de leitor de tela, que não podem aproveitar o flexível esquema de disposição espacial de plug-ins do Accerciser. Quando o modo unificado está desabilitado, as abas de plug-ins podem ser arrastadas e soltadas em diferentes visões de plug-in, ou podem ser arrastadas para a área de trabalho para colocar aquele plug-in em uma nova visão. O arranjo de plug-ins também pode ser manipulado com o menu de contexto do plug-in, que pode ser obtido tanto da aba de plug-in quanto do diálogo de preferências de plug-in.

source: Usage
pt_br: Uso

source: You can use Accerciser to inspect any accessible widget shown in the tree view using the available plugins. The first step is to select an accessible to inspect using one of the following methods:
pt_br: Você pode usar o Accerciser para inspecionar qualquer widget acessível mostrado na visão em árvore utilizando os plug-ins disponíveis. O primeiro passo é selecionar um objeto acessível para inspecionar, usando um dos seguintes métodos:

source: Select an accessible through the tree view.
pt_br: Selecione um objeto acessível através da visão em árvore.

source: Use the tree view to navigate the hierarchy of accessible objects rooted at desktop. Unfolding a tree node reveals its immediate children while folding it hides them. Each node shows an icon for its associated application or widget role and its accessible name, if available. The second column lists how many nodes will be shown if the item is unfolded.
pt_br: Use a visão em árvore para navegar pela hierarquia de objetos acessíveis, oriundos da área de trabalho. Expandir um nó da árvore revela seus filhos imediatos, e recolher o nó os esconde. Cada nó mostra um ícone correspondente ao aplicativo associado ou a lista de widget e o seu nome acessível, se disponível. A segunda coluna lista quantos nós serão mostrados se o item for expandido.

source: Using bookmarks
pt_br: Usando marcadores

source: Accerciser allows bookmarking selected accessibles for later examining. This could be helpful if the target application must be restarted, for example after rebuilding it. To bookmark the currently selected accessible do BookmarksAdd Bookmark... or press Controld.
pt_br: O Accerciser permite colocar marcadores selecionando os objetos acessíveis para uma futura verificação. Isto pode ser de grande ajuda se o aplicativo alvo precisar ser reiniciado, por exemplo depois de recompilá-lo. Para colocar um marcador no objeto acessível atual selecionado, vá até MarcadoresAdicionar marcador... ou pressione Controld.

source: Bookmarks to accessibles in Accerciser are defined by an application name and a "path" in the application's internal accessible hierarchy to the bookmarked accessible. When the target application is in a different state (ie. multiple top level frames) the path might not be correct.
pt_br: Os marcadores para objetos acessíveis no Accerciser estão definidos pelo nome do aplicativo e um "caminho" na hierarquia interna de acessibilidade do aplicativo para o marcador acessível. Quando o aplicativo alvo está em um estado diferente (ex. muitos quadros de níveis superiores) o caminho pode não estar correto.

source: Bookmarks could be managed by accessing the bookmark editing dialog through BookmarksEdit Bookmarks....
pt_br: Marcadores podem ser gerenciados acessando a janela dos editores de marcador em MarcadoresEditar marcadores....

source: Default Plugins
pt_br: Plug-ins predefinidos

source: Accerciser comes with several default plugins. These plugins allow you to view a variety of information about the currently selected accessible in the tree view and its neighbors. The default plugins available in 0.1.5 are the following:
pt_br: O Accerciser vem com diversos plug-ins predefinidos. Estes plug-ins permitem que você veja uma variedade de informações sobre o objeto acessível selecionado atualmente na visão em árvore e seus vizinhos. Os plug-ins predefinidos disponíveis na versão 0.1.5 são os seguintes:

source: This plugin displays information about the available interfaces for the selected tree view accessible. Unsupported interfaces are grayed out. Various instruments for viewing and controlling an interface are available under each expander.
pt_br: Este plug-in exibe informações sobre as interfaces disponíveis para o objeto acessível selecionado na visão em árvore. Interfaces sem suporte estarão acinzentadas. Vários instrumentos para ver e controlar uma interface estão disponíveis abaixo de cada expansor.

source: Interfaces that are supported by the selected accessible are shown as sensitive.
pt_br: As interfaces com suporte do objeto acessível selecionado são mostradas como sensíveis, não acinzentadas.

source: This plugin monitors the selected types of events from the selected tree view accessible, from the selected tree view application, or the entire desktop.
pt_br: Este plug-in monitora os tipos de eventos selecionados da visão em árvore de acessíveis, da visão em árvore do aplicativo selecionado, ou de toda a área de trabalho.

source: The bottom part of the event monitor window allows you to pick the type and source of events.
pt_br: A parte inferior da janela do monitor de eventos permite que você selecione o tipo e a fonte de eventos.

source: By pressing ControlAltl anywhere on the desktop, the last logged event will be highlighted for later reference. See for how to change this key combination.
pt_br: Pressionando ControlAltl em qualquer parte da área de trabalho, o último evento registrado será destacado para futura referência. Veja para alterar a combinação de teclas.

source: This plugin is a fully-fledged IPython console. Press Tab to show completions for the current command. Press Enter to execute any valid Python code. Commands at the console have access to the currently selected accessible in the accessible tree by way of the acc variable. In addition, all functions and constants from the pyatspi package are available as locals in the console. The most important of these are the functions for querying to other accessibility interfaces. For example, to query to the Text interface: t = acc.queryText() . Imports from the current working directory or Python path are also allowed.
pt_br: Este plug-in é um console completo em IPython. Pressione Tab para mostrar complementações para o comando atual. Pressione Enter para executar qualquer código Python válido. Os comandos no console possuem acesso ao objeto acessível atualmente selecionado na árvore de acessibilidade de acordo com a variável acc. Além disso, todas as funções e constantes do pacote pyatspi estão disponíveis como locais, no console. A mais importante delas são as funções para consultar outras interfaces de acessibilidade. Por exemplo, para consultar a interface de Texto: t = acc.queryText() . Também é permitido importar do diretório de trabalho atual ou do caminho Python.

source: This plugin shows the interfaces, methods, and attributes supported by the accessible selected in the tree view.
pt_br: Este plug-in mostra as interfaces, métodos e atributos com suporte do objeto acessível selecionado na visão em árvore.

source: The API browser.
pt_br: O navegador API.

source: Script recorder
pt_br: Gravador de script

source: Accerciser's script recorder allows users to record keyboard interaction with other desktop applications for the purpose of authoring UI test scripts. Currently the plug-in supports the generation of scripts for three platforms: Dogtail, LDTP, and an Accerciser's built-in API. Once you press the "Record" button every keyboard interaction will be recorded in to a script that could be executed later as a stand alone script.
pt_br: O gravador de script do Accerciser permite aos usuários gravar a interação do teclado com outras aplicações da área de trabalho com o propósito de criar teste UI. Atualmente o plug-in suporta a geração de scripts de três plataformas: Dogtail, LDTP, e a API integrada do Accerciser. Uma vez pressionado o botão "Gravar", cada interação do teclado será gravada em um script que poderá ser posteriormente executado como um script independente.

source: The script recorder.
pt_br: O gravador de script.

source: Quick select
pt_br: Seleção rápida

source: This plugin provides global hotkeys for allowing quick selection of accessibles through the target application's UI. Pressing ControlAlta will select the last focused widget's accessible in Accerciser. Pressing ControlAltt will select the accessible of the widget that is under the pointer.
pt_br: Este plug-in fornece teclas de atalho globais para permitir a seleção rápida de objetos acessíveis através de aplicações-alvo UI. Pressionando ControlAlta selecionar-se-á o último widget focalizado acessível no Accerciser. Pressionando ControlAltt será selecionado o objeto acessível do widget que encontra-se abaixo do ponteiro.

source: Validation
pt_br: Validador

source: This plugin checks applications for accessibility problems and generates a report including the severity and description of the problems. The report links errors to documentation about how to remedy common problems. The plugin is extensible with test schemas that define rules for validation.
pt_br: O plug-in verifica aplicativos quanto a problemas de acessibilidade, e gera um relatório incluindo a gravidade e a descrição dos mesmos. O relatório vincula erros para a documentação sobre como remediar problemas comuns. O plug-in é extensível com alguns esquemas de teste que definem regras para validação.

source: To run the validator, first select an item in the accessibility tree. The plugin will test the selected accessible and all of its descendants. Next select a schema to use for the test. Then click the Validate button to start the test. While the test is running, click the button again to cancel it.
pt_br: Para rodar o validador, primeiramente selecione um item na árvore de acessibilidade. O plug-in testará o acessível selecionado e todos os seus descendentes. Depois selecione um esquema para usá-lo no teste. Em seguida clique no botão Validar para iniciar o teste. Enquanto o teste é executado, clique no novamente no botão para cancelá-lo.

source: When the test completes, the report table shows the severity and description of all errors. Double click a row in the table to show the associated accessible in the tree. With an item selected, click the Help to get information about how to resolve the problem.
pt_br: Quando o teste termina, a tabela de relatório exibe a severidade e descrição de todos os erros. Dê um clique duplo em uma linha na tabela para exibir os acessíveis associados na árvore. Com um item selecionado, clique em Ajuda para obter informações sobre como resolver o problema.

source: Preferences
pt_br: Preferências

source: There are some elements in Accerciser that are configurable:
pt_br: Alguns elementos do Accerciser são configuráveis:

source: Plugin Layout
pt_br: Layout de plug-ins

source: There are two methods for configuring plugin layout in Accerciser. First you may choose EditPreferences to activate the Preferences dialog. This dialog contains tabs for each section, select the Plugins tab. Under this section you will find a list view of all the available plugins. Right-click on any of the plugins listed to configure it's view.
pt_br: Há dois métodos para configurar o layout do plug-in no Accerciser. Primeiramente você deve escolher EditarPreferências para ativar a janela de diálogo Preferências. Esta janela de diálogo contém abas para cada seção, selecione a aba Plug-ins. Abaixo desta seção você encontrará uma visualização em lista de todos os plug-ins disponíveis. Dê um clique direito em qualquer um dos plug-ins listados para configurar a sua respectiva visualização.

source: You may bypass the Preferences dialog by using drag and drop to move plugin tabs. Dragging a plugin tab to the bottom or right plugin area in the main window will move the plugin. Dragging a tab to the desktop will create a new plugin window and drop the plugin in it.
pt_br: Você pode ignorar a janela de diálogo Preferências utilizando-se de arrastar e soltar para mover abas de plug-in. Arrastar uma aba de plug-in, para o inferior ou para a área de plug-in direita na janela principal, moverá o plug-in. Arrastar uma aba para a área de trabalho será criado uma janela de plug-in novo e soltará o plug-in nela.

source: Global Hotkey Configuration
pt_br: Configuração globais das teclas de atalho

source: Some elements in Accerciser may enable certain functionality via hotkeys. The hotkey combination could be changed via the Preferences dialog, to do so you may select EditPreferences to activate the Preferences dialog. This dialog contains tabs for each section, select the Global Hotkeys tab. Under this section you will find a list view of all the available hotkey features. Change the key bindings to you liking.
pt_br: Alguns elementos do Accerciser podem ativar certa funcionalidade através das teclas de atalho. A combinação das teclas de atalho pode ser alterada através da janela Preferências, para fazê-lo deve-se selecionar EditarPreferências para ativar o menu Preferências. Esta janela contém abas para cada seção, selecione a aba Teclas de atalho globais. Embaixo dessa seção você encontrará uma lista de todas as teclas de atalho disponíveis. Mude as combinações das teclas ao seu gosto.

source: About Accerciser
pt_br: Sobre o Accerciser

source: Accerciser was written by Eitan Isaacson (eitan@ascender.com). To find more information about Accerciser, please visit the Accerciser GNOME Live! page.
pt_br: O Accerciser foi escrito por Eitan Isaacson (eitan@ascender.com). Para procurar mais informações sobre o Accerciser, por gentileza visite a Accerciserpágina do GNOME Live!.

source: To report a bug or make a suggestion regarding this application or this manual, follow the directions in this document.
pt_br: Para relatar algum erro, ou fazer uma sugestão relacionada a este aplicativo ou este manual, siga as instruções deste documento.

source: Redistribution and use in source and binary forms, with or without modification, are permitted under the terms of the BSD License.
pt_br: A redistribuição e o uso nas formas binárias e em código, com ou sem modificação, são permitidas sobre os termos da licença BSD.

source: The default plugin layout for the bottom panel
pt_br: A disposição padrão de plug-ins para o painel de base

source: The default plugin layout for the top panel
pt_br: A disposição padrão de plug-ins para o painel do topo

source: The duration of the highlight box when selecting accessible nodes
pt_br: A duração da caixa de destaque ao selecionar nós acessíveis

source: Start
pt_br: Início

source: End
pt_br: Fim

source: Too many selectable children
pt_br: Muitos filhos selecionáveis

source: (Editable)
pt_br: (Editável)

source: Quick Select
pt_br: Seleção rápida

source: Plugin with various methods of selecting accessibles quickly.
pt_br: Plug-in com vários métodos para selecionar objetos acessíveis rapidamente.

source: Inspect last focused accessible
pt_br: Inspeciona o último objeto acessível em foco

source: Inspect accessible under mouse
pt_br: Inspeciona objeto acessível abaixo do mouse

source: Sche_ma:
pt_br: Esque_ma:

source: V_alidate
pt_br: V_alidar

source: Idle
pt_br: Ocioso

source: No description
pt_br: Sem descrição

source: AT-SPI Validator
pt_br: Validador de AT-SPI

source: Validates application accessibility
pt_br: Valida acessibilidade do aplicativo

source: Level
pt_br: Nível

source: Role
pt_br: Função

source: Saving
pt_br: Salvando

source: Validating
pt_br: Validando

source: EXCEPT
pt_br: EXCEÇÃO

source: ERROR
pt_br: ERRO

source: WARN
pt_br: AVISO

source: INFO
pt_br: INFORMAÇÃO

source: DEBUG
pt_br: DEPURAÇÃO

source: Basic
pt_br: Básico

source: Tests fundamental GUI application accessibility
pt_br: Testa acessibilidade fundamental de GUI do aplicativo

source: actionable %s is not focusable or selectable
pt_br: Acionável %s não é focalizável ou selecionável

source: interactive %s is not actionable
pt_br: interativo %s não é acionável

source: more than one focused widget
pt_br: mais de um componente em foco

source: %s has no text interface
pt_br: %s não possui interface de texto

source: %s index in parent does not match child index
pt_br: índice %s no parente não corresponde ao índice do filho

source: Missing reciprocal for %s relation
pt_br: Faltando recíproco da relação %s

source: %s missing name or label
pt_br: faltando nome ou rótulo de %s

source: focusable %s has a table interface, but not a selection interface
pt_br: %s focalizável possui uma interface de tabela, mas não uma interface de seleçãobutton has focused state without focusable state

source: %s has %s state without %s state
pt_br: %s possui estado %s sem estado %s

source: %s does not belong to a set
pt_br: %s não pertence a um grupo
